9/data/attachments/e812b0cab1b5983e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_9a792671-dcaa-4f0d-97c6-eb921bf131e8</nif:username>
            <nif:friendToBeAdded>Caroline_drug_Actions_43796_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>